/* eslint-disable import/no-unresolved */
// import HeaderBack from "@components/common/header/HeaderBack";
import HeaderBack from "@components/common/header/HeaderBack";
import styles from "./styles.module.scss";

const PrivacyPolicyContainer = () => {
  return (
    <>
      <HeaderBack title="プライバシーポリシー" hasMenu />
      <div className={styles.container}>
        <div className={styles.content}>
          Fantrec株式会社（以下、当社）はインターネット関連コンテンツの企画・制作を中心に、インターネット関連マーケティングサービスなど、総合的なインターネット関連サービスを提供している会社です。
          <br />
          業務において、個人情報をやむを得ず取り扱う場合には、以下に定める個人情報保護方針に基づいて、事業活動に関わる全ての社員がこれを実行し維持することを宣言いたします。
          <br />
          <br />
          1. 個人情報の取得・利用・提供について
          <br />
          当社は、事業内容及び事業規模を考慮して、適切に個人情報を取得するとともに、利用目的の達成に必要な範囲内で取扱い、取得時の利用目的を超えた個人情報の利用はいたしません。また個人情報を本人の同意なしに第三者に提供をいたしません。
          <br />
          なお、当社は利用目的の達成のため、必要な範囲内で個人情報の取扱いの一部又は全部を外部（当社関係会社を含む）に委託することがあります。
          <br />
          <br />
          2. 法令等の遵守について
          <br />
          当社は、本個人情報保護方針の運営にあたり、個人情報保護法等の個人情報の
          取扱いに関する法令、同法関連ガイドライン等の国が定める指針、その他の規範を遵守します。
          <br />
          <br />
          3. 個人情報保護のための安全対策の実施について
          <br />
          当社は保有する個人情報を利用目的に応じ必要な範囲内において、正確、かつ、最新の状態で管理し、個人情報の漏洩、滅失又は毀損などに対して合理的な安全対策を講じ、予防並びに是正に努めます。当社が個人情報の処理を外部へ委託する場合には、漏洩や第三者への提供を行わないよう契約により義務づけ、適切な管理を実施いたします。当社は、個人情報に関わる事故が発生した場合にも、被害の拡大を防止し事態を収束する措置を速やかに講じるのみならず、事故発生の原因分析による問題点の抽出および解消し、再発を防止する措置を講じます。
          <br />
          <br />
          4. 個人情報の取り扱いに関する苦情及び相談
          <br />
          当社は、個人情報の取り扱いに関する苦情、相談等に関する窓口として「個人情報お問合せ窓口」を設置し、遅滞なく、速やかに対応を行います。
          <br />
          <br />
          5. 個人情報保護の継続的改善
          <br />
          当社は、社会情勢の変化や情報技術の進歩等に対応し、また当社の経営環境を鑑み、定期的に本個人情報保護方針の内容及び運用状況を確認し、見直して改善を行います。
          <br />
          当社は、以上の方針のもと個人情報を保護することを宣言いたします。
          <br />
          <br />
          2023年3月7日 制定
          <br />
          ファントレック株式会社
          <br />
          代表取締役 津田 柊太朗
          <br />
          <br />
          個人情報保護に関するお問合せ窓口
          <br />
          当社の個人情報の取扱い及び個人情報保護マネジメントシステムに関する、ご本人からの苦情、相談、第三者提供の停止及び開示等のお問合せについては以下窓口までお願い致します。適切かつ迅速な対応をさせていただきます。
          <br />
          ファントレック株式会社
          <br />
          東京都港区芝2-26-6
          <br />
          iq@fantrec.com
          <br />
          <br />
          当社が保有する個人情報の利用目的と開示対象個人情報について
          <br />
          <br />
          1.個人情報取扱業者の名称
          <br />
          Fantrec株式会社
          <br />
          2.個人情報保護管理者
          <br />
          津田 柊太朗
          <br />
          3. 「当社の保有する個人情報」の利用目的に関する事項
          <br />
          「当社の保有する個人情報」の利用目的は以下のとおりです。
          <br />
          3-1. 当社への採用選考において、当社へ応募する方の個人情報
          <br />
          目的：採用選考および面接等の連絡のため
          <br />
          3-2. 当社社員の個人情報
          <br />
          目的：人事管理業務および業務の連絡のため
          <br />
          3-3. 退職者情報
          <br />
          目的：在職中の業務に関する問い合わせと懇親等の必要に応じた連絡のため
          <br />
          3-4. 当社が行うPCおよび携帯サイトでの各種サービス事業への登録者情報
          <br />
          1) サービスを提供するため
          <br />
          2) 上記に関する連絡をおこなうため
          <br />
          3) 希望者へのメールマガジン配信のため
          <br />
          4) 会員管理のため
          <br />
          5) 商品または景品等を発送するため
          <br />
          6) ご請求管理のため
          <br />
          7) 上記に関する連絡をおこなうため
          <br />
          8) 各種ご案内のため
          <br />
          9) トラブル・規約違反の際における当事者間の連絡のための情報開示
          <br />
          10)
          サービスでの利用用途に限定した、サービス登録者あるいは契約企業への提供
          <br />
          11) 特典(商品)や景品等の発送の用途に限定した、契約企業への提供
          <br />
          <br />
          個人情報保護方針について
          <br />
          お問合わせ内容、ご連絡先を明記の上、下記メールアドレスまでご連絡ください。担当者より、順次、ご回答させて頂きます。ご回答までに数日お時間を頂く場合もありますので、予めご了承ください。
          <br />
          ファントレック株式会社
          <br />
          東京都港区芝2-26-6
          <br />
          iq@fantrec.com
          <br />
          <br />
          個人情報の取扱いについて
          <br />
          送付頂いた内容は、お問合せ対応のために利用致します。
          <br />
          本人の同意がある場合又は法令に基づく場合を除き、取得した個人情報を第三者に提供することはありません。
          <br />
          入力内容の保管についてはデータベースサービスプロバイダーに委託する場合があります。
          <br />
          ご本人からの求めにより、当社が保有する開示対象個人情報の利用目的の通知・開示・内容の訂正・追加または削除・利用の停止・消去および第三者への提供の停止（「開示等」といいます。）に応じます。開示等の手続きは「当社が保有する個人情報及び開示対象個人情報について」をご覧ください。
          <br />
        </div>
      </div>
    </>
  );
};

export default PrivacyPolicyContainer;
