/* eslint-disable import/no-unresolved */
import HeaderBack from "@components/common/header/HeaderBack";
import styles from "./styles.module.scss";

const TermsOfServiceContainer = () => {
  return (
    <>
      <HeaderBack title="利用規約" hasMenu />
      <div className={styles.container}>
        <div className={styles.content}>
          本利用規約（以下「本規約」といいます）には、本サービスの提供条件及び当社とユーザーの皆様との間で権利義務関係が定められています。本サービスの利用に際しては、本規約の全文をお読みいただいたうえで、本規約に同意いただく必要があります。
          <br />
          <br />
          第1条　定義 <br />
          1.　「本サービス」とは、Fantrec株式会社（以下「当社」といいます）が提供するサービスである「みんラリ」で提供される全てのサービスを指します。
          <br />
          2.　「ラリー」とは、本サービスを使用して地図上に配置された地点を巡る企画をいいます。
          <br />
          3.　「ユーザー」とは、本規約に同意し、「ラリーマスター」（以下「ラリマス」といいます）が本サービスを利用して企画したラリーに参加する方をいいます。
          <br />
          4.　「スポット」とは、ラリーにおいて情報を登録された建物、店舗等を含む「ラリマス」が指定した地点の総称をいいます。
          <br />
          5.　「ラリマス」とは、ラリーを企画し、スポットや特典その他の情報の登録・提供を行うことができる方をいいます。このラリマスには、当社を含む事業者全般を含みます。
          <br />
          6.　「利用者」とは、ユーザー及びラリマスの総称をいいます。ただし、当社はここに含まれません。
          <br />
          <br />
          第２条　利用規約への同意
          <br />
          1.　本規約は、本サービスの提供条件及び本サービスの利用に関する当社とユーザーとの間の権利義務関係を定めることを目的とし、ユーザーが本サービスを利用するにあたっての一切の行為及び法律関係に適用されます。
          <br />
          2.　ユーザーは本規約に従って本サービスを利用するものとします。
          <br />
          3.　ユーザーは、本サービスを利用することにより、本規約の全ての記載内容について同意したものとみなされます。
          <br />
          <br />
          第3条　規約の適用及び適用範囲
          <br />
          1.　当社が当社ウェブサイト上等で掲載する本サービス利用に関するルールは、本規約の一部を構成するものとします。
          <br />
          2.　本サービスの利用に際して、スポット上に個別の利用規約等の約定が定められていることがありますが、これらのスポットの利用規約等が本規約と整合しない場合においては、本規約が優先するものとします。
          <br />
          3.　本規約と本規約以外での本サービスの案内内容とが整合しない場合は、本規約が優先して適用されるものとします。
          <br />
          <br />
          第4条　規約の変更
          <br />
          1.　当社は、本規約の内容を任意の理由で変更できるものとします。
          <br />
          2.　当社が本規約を変更するときは、変更の効力を生ずる日を定め、本規約を変更する旨及び変更後の規約の内容を、本サービス上に表示することによってこれを行います。
          <br />
          3.　ユーザーが本規約の変更の効力発生後に本サービスを利用した場合には、本規約の変更に全て同意したものとみなされます。
          <br />
          <br />
          第5条　ユーザーに提供される本サービスの内容
          <br />
          1.　当社がユーザーに提供する本サービスの内容は、以下の通りとします。
          <br />
          ①本サービスへの登録
          <br />
          ②登録情報の変更・削除
          <br />
          ③ラリー情報の本サービス上での閲覧
          <br />
          ④スポット情報の本サービス上での閲覧及びそれらのスポットへのチェックイン
          <br />
          ⑤ラリーへのコメント及びレビューの投稿
          <br />
          ⑥ラリー及び各スポットで取得可能なポイント及び特典の取得及びその利用
          <br />
          ⑦ラリマスへのメッセージ送信
          <br />
          ⑧ラリマスのフォロー
          <br />
          ⑨ラリー情報の他ユーザーへのシェア
          <br />
          ⑩その他、上記①から⑨に関連するサービス
          <br />
          各詳細は、本サービスのウェブサイト上に掲載される説明をご参照ください。
          <br />
          2.　当社は、本サービスの変更及びその全部または一部の終了等を、独自の判断により自由に行えるものとします。ユーザーは、予めこれらの変更等に同意するものとします。
          <br />
          <br />
          第6条　ラリマスに提供される本サービスの内容
          <br />
          1.　当社がラリマスに提供する本サービスの内容は、以下の通りとします。
          <br />
          ①ラリマスへの登録申請
          <br />
          ②登録情報の変更・削除
          <br />
          ③ラリーの作成
          <br />
          ④ラリー情報の変更・削除
          <br />
          ⑤ラリー管理者の引継ぎ
          <br />
          ⑥ラリーに参加したユーザーへの報酬の設定
          <br />
          ⑦その他、上記①から⑥に関連するサービス
          <br />
          各詳細は、本サービスのウェブサイト上に掲載される説明をご参照ください。
          <br />
          2.　当社は、本サービスの変更及びその全部または一部の終了等を独自の判断により自由に行えるものとします。ラリマスは、予めこれらの変更等に同意するものとします。
          <br />
          <br />
          第7条　利用者の本サービスの利用
          <br />
          1.　利用者は、本規約を遵守することに同意し、かつ当社の定める一定の情報を当社の定める方法で当社に提供することにより、当社に対し、本サービスの利用の登録ないしは申請を行うことができます。
          <br />
          2.　利用者は、本サービス所定の申請を行い、登録手続が完了することにより、サービス利用契約が利用者と当社との間に成立し、利用者は本サービスを利用することができます。
          <br />
          3.　利用者は、本サービスを利用する場合、自己の責任でこれを行うものとします。
          <br />
          4.　利用者は、当社に提供した情報に変更があった場合、当社の定める方法により変更事項を遅滞なく当社に通知するものとします。
          <br />
          5.　次に該当する場合、利用者は本サービスを利用することができず、当社はサービスの利用を拒否することがあります。なお、当社は、サービスの拒否の理由について一切開示義務を負わないものとします。
          <br />
          ①利用者が当社に提供した必要事項の全部又は一部につき、虚偽、誤記又は記載漏れがあった場合。
          <br />
          ②利用者が過去に第14条に定める利用の一時停止、永久的停止、登録の抹消又は契約の解除の措置を受けたことがあると判明した場合。
          <br />
          ③利用者が第20条に定める反社会的勢力による利用の禁止に抵触する者であると判明した場合。
          <br />
          ④その他、本サービスを利用することが適当でないと当社が判断した場合。
          <br />
          6.　利用者は、本サービス上で説明される所定の方法により、本サービスを利用することができます。
          <br />
          7.　ユーザーによる特典の利用その他、ラリーに関する一切の要請、照会又は請求等は、ユーザーがラリマスに対して直接行うものとします。
          <br />
          8.　ラリマスが本サービス上で提供しているラリーを中止、変更又は削除等をした場合であっても、当社は一切の責任を負わず、ユーザーは当社に対していかなる損害の賠償も請求できないものとし、ラリマスの責任において解決するものとします。
          <br />
          <br />
          第8条　権利帰属等
          <br />
          1.　本サービス及び当社ウェブサイトに関する知的財産権その他の権利は、全て当社または当社にライセンスを許諾している者に帰属します。当社は、利用者に対し、譲渡及び再許諾不能な非独占的な利用権を付与することで、本サービスが成立します。なお、これらの利用権の付与によっても、これらの知的財産権その他の権利は、当社から利用者に移転することはありません。
          <br />
          2.　利用者は、本サービスの利用に際し、自らが適法な権利を有していること、第三者の権利を侵害していないことについて、当社に対し表明し、保証するものとします。
          <br />
          <br />
          第9条　禁止事項
          <br />
          　利用者は、本サービスを利用するにあたり、以下の行為をしてはならないものとします。
          <br />
          1.　法令、裁判所の判決・決定等に違反する行為又は犯罪行為に関連する行為
          <br />
          2.　当社又は第三者に損害を生じさせるおそれのある目的又は方法で、本サービスを利用し、又は利用しようとする行為。
          <br />
          3.　当社又は第三者の知的財産権、肖像権、プライバシーの権利、名誉、その他法令上もしくは契約上保護されるべき権利利益を侵害し、もしくはそのおそれのある行為。
          <br />
          4.　本サービス及び本サービス上の情報を自己又は第三者のために、本サービスの利用目的以外の目的で利用する行為。
          <br />
          5.　本サービスに虚偽の情報を登録・掲載する行為及び第三者になりすまして本サービスを利用する行為。
          <br />
          6.　本サービスへの有害なコンピュータープログラム、過度の負荷等を含む情報の送信又は投稿その他、システムに障害を与える行為。
          <br />
          7.　本サービスの不具合を意図的に利用する行為。
          <br />
          8.　本サービスに対するリバースエンジニアリング（弊社のサービスの全部または一部を利用し、技術情報を転用すること）その他の解析行為。
          <br />
          9.　その他、法令及び公序良俗に反し、又はそのおそれのある行為。
          <br />
          10. その他、当社が不適切と判断する行為。
          <br />
          11.　前各項のいずれかに該当する行為を援助、助長又は試みる行為。
          <br />
          <br />
          第10条　機密保持
          <br />
          　利用者は、本サービスに関連して当社が機密に取り扱うことを明示した非公開の情報について、法令により開示が義務付けられる場合を除き、当社の書面による事前の承諾なく、第三者に開示又は漏洩してはならないものとします。
          <br />
          <br />
          第11条　広告及びプロモーション
          <br />
          　本サービスでは、サービス上又はサービスに関連してサードパーティからの広告やプロモーションを実行したり、サードパーティの製品やサービスの情報やそれらの情報へのリンクを提供する場合がありますが、これらから生じるあらゆる取引やその条件等はユーザーとサードパーティの間のものとなり、当社はこれらに一切の関わりを有しません。よって、当社はこうした取引や広告、プロモーションの結果として生じたあらゆる損失又は損害に対して一切の責任を負いません。
          <br />
          <br />
          第12条　第三者提供のサービス
          <br />
          　本サービス上では、本サービス以外のサービスやウェブサイトへのリンクを掲載することができます。ただし、利用者がこれらの第三者のウェブサイト等にアクセスする場合には、利用者自身の責任によりこれを行うものとします。当社はこれらの第三者のウェブサイト等の内容や機能、それらの正確性、適法性につき一切の責任を負いません。また、当社はこれらの第三者のウェブサイトを通じて利用者に発生したあらゆる損失又は損害に対して一切の責任を負いません。
          <br />
          <br />
          第13条　個人情報の取り扱い
          <br />
          1.　当社は、本サービスの提供に際してユーザーから取得した個人情報（個人情報保護法にいう「個人情報」をいいます）を、別途定める当社のプライバシーポリシーに従って適切に取り扱うものとし、利用者は、当社がこのプライバシーポリシーに従ってその個人情報を取り扱うことについて同意するものとします。
          <br />
          2.　当社は、利用者が本サービスへの利用登録をする際に、氏名、住所、電話番号、メールアドレス等の個人情報を照会することがあります。
          <br />
          3.　個人情報の取り扱いに際し、当社の責に帰すことなく当該情報が消失又は紛失し、ラリマスやスポット、又はユーザーその他の利用者や第三者に損害を与えた場合、当社は一切の責任を負わないものとします。
          <br />
          <br />
          第14条　違反等に対する措置
          <br />
          1.　利用者が以下のいずれかに該当すると当社が判断した場合、当社は事前の通告又は催告をすることなく、当該利用者の本サービスの利用の一時停止、永久的停止、登録情報の抹消又は本サービスの利用契約の解除その他、当社が必要と判断する措置をとることができます。
          <br />
          ①第9条各項の事由に該当することが判明した場合。
          <br />
          ②利用者と連絡を取ることができない場合。
          <br />
          ③その他、当社が利用者による本サービスの利用の継続を適当でないと判断した場合。
          <br />
          2.　当社は、本条に基づき当社が行った措置により利用者に生じた損害につき、一切の責任を負わないものとします。
          <br />
          <br />
          第15条　本サービスの一次停止、永久的停止
          <br />
          　当社は、当社が必要と判断した場合、利用者への事前の通知なく、本サービスの一部又は全部を一時的ないしは永久的に停止する場合があります。この場合においても、利用者に生じた損害につき、当社は一切の責任を負わないものとします。なお、永久的な停止に際しても、継続すべき性質を有する本規約の全条件は、契約終了後も継続するものとします。
          <br />
          <br />
          第16条　免責事項
          <br />
          1.　当社は、本サービス上で提供される利用者の情報を含む全ての情報（本サービス自体及び本サービスに関連して送信される電子メール等により提供される情報並びに本サービス上に表示される第三者が管理・運営するウェブサイト等へのリンク及びこれらのウェブサイト上に含まれる一切の情報を含みます）に関する正確性、適法性等につき、利用者に対して何らの保証も行わないものとします。また、当該情報の利用に関して利用者に生じたあらゆる損害につき、当社は一切の責任を負わないものとします。
          <br />
          2.　本サービスの利用に関して、本サービスの不具合や利用者のスマートフォンやPC機器に与える影響及び利用者が本サービスを正常に利用できないことによって被る不利益、その他利用者が被る一切の不利益について、当社に故意又は重大な過失がある場合を除き、当社は一切の責任を負わないものとします。なお、当社が責任を負う場合であっても、当社は、本項に記載された利用者の損害について、過去１年間に利用者が当社に直接支払った対価の金額を超えて賠償する責任を負わないものとし、また、付随的損害、間接損害、特別損害、将来の損害及び逸失利益にかかる損害については、賠償する責任を負わないものとします。
          <br />
          3.　本サービスの利用に際して、利用者間及び利用者とスポットの間にて生じたあらゆる紛争やトラブル、違法行為等につき、当社は一切の責任を負わず、利用者が自己の責任によって解決するものとします。
          <br />
          <br />
          第17条　本サービスのバージョンアップ
          <br />
          1.　当社は、当社が必要と判断した場合、いつでも利用者に対し、本サービスのバージョンアップ版の開発・提供、又はバージョンアップ情報等及びサポートサービスの提供を行うことができます。その際、旧バージョンのサービスが利用できなくなることによって利用者に生じたあらゆる損害につき、当社は一切の責任を負わないものとします。
          <br />
          2.　当社は利用者に対し、本サービスのバージョンアップ版を開発・提供する義務及び本サービスに関するサポートを行う義務を負わないものとします。
          <br />
          3.　当社は次の各号のいずれの事由が発生した場合においても、利用者に対して一切の責任を負わないものとします。
          <br />
          ①本サービスが変更、中断、中止もしくは廃止された場合。
          <br />
          ②当社が相当の安全対策を講じたにもかかわらず、データへの不正アクセス、コンピューターウイルスの混入等の不正行為が行われ、これに起因して損害が発生した場合。
          <br />
          ③ラリマス又はスポットが本サービスのお利用を通じて任意に提供する情報、ポイント又は特典等のサービスの内容及びその改廃に起因して損害が発生した場合。
          <br />
          <br />
          第18条　譲渡
          <br />
          1.　利用者は、当社の事前の書面による承諾、あるいはシステム上設定された条件が満たされ許諾されない限り、本サービスに関する権利義務又は契約上の地位を、他の利用者及び第三者に譲渡できないものとします。
          <br />
          2.　当社が本サービスの全部又は一部を第三者に譲渡（事業譲渡、会社分割その他事業が移転するあらゆる場合を含みます）した場合、当該譲渡に伴い、契約上の地位、本規約に基づく権利及び義務並びに利用者の登録事項その他の顧客情報を当該譲渡の譲受人に譲渡することができるものとし、利用者はかかる譲渡につき予め同意したものとします。
          <br />
          3.　当社は、本サービスの全部又は一部を第三者に譲渡した場合には、ウェブサイトへの掲載その他当社が適当と判断する方法で、利用者に通知するものとします。
          <br />
          <br />
          第19条　損害賠償
          <br />
          1.　利用者は、本規約に違反し又は本サービスの利用をしたことに起因して、当社や他の利用者もしくは第三者に損害を与えた場合には、自己の責任と費用で当該損害を賠償するものとします。
          <br />
          2.　利用者が本サービスを利用したことに起因して、当社が第三者からクレームや何等かの請求又は訴追等を受けた場合、利用者は自己の責任と費用でこれに対応し、当社に対していかなる損害も与えてはならないものとします。また、これにより損害が発生した場合には、当該利用者は自己の責任と費用において、当社に対してこれを賠償するものとします。
          <br />
          <br />
          第20条　反社会的勢力による利用の禁止
          <br />
          1.　利用者は、自らが本サービスの利用の開始日において、次の各号のいずれにも該当しないことを表明し、かつ将来にわたっても該当しないことを確約するものとします。
          <br />
          ①暴力団
          <br />
          ②暴力団員
          <br />
          ③暴力団員でなくなった時から5年を経過しない者
          <br />
          ④暴力団準構成員
          <br />
          ⑤暴力団関係企業
          <br />
          ⑥総会屋
          <br />
          ⑦社会運動等標ぼうゴロ
          <br />
          ⑧特殊知能暴力集団
          <br />
          ⑨その他前各号に準ずる者
          <br />
          2.　利用者が法人又は団体である場合、利用者は自らが本サービスの利用の開始日において、次の各号のいずれにも該当しないことを表明し、かつ将来にわたっても該当しないことを確約するものとします。
          <br />
          ①反社会的勢力によって支配されていること
          <br />
          ②反社会的勢力が経営に実質的に関与していること
          <br />
          ③自己もしくは第三者の不正の利益を図る目的又は第三者に損害を加える目的をもってするなど、不当に反社会的勢力を利用していること
          <br />
          ④反社会的勢力に対して資金等を提供し、又は便宜を供与するなどの関与をしていること
          <br />
          ⑤自ら役員又は経営に実質的に関与している者が、反社会的勢力と社会的に避難されるべき関係を有すること
          <br />
          3.　利用者は当社及び他の利用者に対し、自ら又は第三者を利用して次の各号に該当する行為を行わないことを確約するものとします。
          <br />
          ①暴力的な要求行為
          <br />
          ②法的な責任を超えた不当な要求行為
          <br />
          ③脅迫的な言動をし、又は暴力を用いる行為
          <br />
          ④風説を流布し、偽計又は威力を用いて当社又は他の利用者の信用を毀損し、又はその業務を妨害する行為
          <br />
          ⑤その他前各号に準ずる行為
          <br />
          4.　利用者が本条の表明に関し虚偽の申告をし、又は本条の確約に違反したことが判明した場合、当社は事前の通知又は催告を行うことなく直ちに利用者の本サービスの利用を停止することができるものとします。
          <br />
          5.　前項に基づく利用の停止に際して当社に生じた損害については、当該利用者はこれを賠償する責任を負うものとします。
          <br />
          6.　第4項に基づく利用の停止に際して当該利用者に発生した損害については、当社は一切の責任を負わないものとします。
          <br />
          <br />
          第21条　準拠法
          <br />
          　本規約の成立、効力、履行及び解釈に関しては、日本法が適用されるものとします。
          <br />
          <br />
          第22条　紛争の解決
          <br />
          1.　本規約又は本サービスに関連して利用者と当社の間で紛争が生じた場合には、利用者と当社の間で誠意をもって協議するものとします。
          <br />
          2.　前項の紛争が協議によっても解決せず、訴訟によって解決する必要が生じた場合、当社の本店所在地を管轄する地方裁判所又は簡易裁判所を、第一審の専属的合意管轄裁判所とします。
          <br />
          <br />
          第23条　分離可能性
          <br />
          　本規約のいずれかの条項またはその一部が、消費者契約法その他の法令等により無効または執行不能と判断された場合であっても、本規約の残りの規定及び一部が無効または執行不能と判断された規定の残りの部分は、継続して完全に効力を有するものとします。
          <br />
          <br />
          2023年3月7日　制定
        </div>
      </div>
      {/* <Copyright /> */}
    </>
  );
};

export default TermsOfServiceContainer;
